results/django-100-1k.2.log

Summary:
  Total:	1.9837 secs
  Slowest:	0.6346 secs
  Fastest:	0.0112 secs
  Average:	0.2315 secs
  Requests/sec:	504.1086
  
  Total data:	1398 bytes
  Size/request:	2 bytes

Response time histogram:
  0.011 [1]	|
  0.074 [29]	|■■■■■
  0.136 [94]	|■■■■■■■■■■■■■■■■■
  0.198 [122]	|■■■■■■■■■■■■■■■■■■■■■■
  0.261 [223]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.323 [94]	|■■■■■■■■■■■■■■■■■
  0.385 [89]	|■■■■■■■■■■■■■■■■
  0.448 [42]	|■■■■■■■■
  0.510 [2]	|
  0.572 [2]	|
  0.635 [1]	|


Latency distribution:
  10% in 0.1004 secs
  25% in 0.1665 secs
  50% in 0.2261 secs
  75% in 0.2953 secs
  90% in 0.3716 secs
  95% in 0.4058 secs
  99% in 0.4441 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0110 secs, 0.0112 secs, 0.6346 secs
  DNS-lookup:	0.0003 secs, 0.0000 secs, 0.0159 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0007 secs
  resp wait:	0.0267 secs, 0.0002 secs, 0.0904 secs
  resp read:	0.0009 secs, 0.0000 secs, 0.0155 secs

Status code distribution:
  [200]	699 responses

Error distribution:
  [60]	Get "http://localhost:8000/health": dial tcp [::1]:8000: connect: connection refused
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51677->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51680->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51682->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51685->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51686->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51687->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51689->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51691->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51692->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51694->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51696->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51698->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51705->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51706->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51707->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51710->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51714->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51717->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51723->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51724->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51727->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51728->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51734->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51737->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51739->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51747->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51758->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51760->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51761->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51764->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51765->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51767->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51768->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51769->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51770->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51771->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51772->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51774->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51775->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51776->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51777->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51778->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51780->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51781->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51782->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51783->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51784->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51785->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51786->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51787->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51788->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51789->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51790->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51791->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51792->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51793->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51794->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51796->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51797->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51798->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51799->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51801->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51802->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51803->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51804->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51805->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51806->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51807->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51808->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51810->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51812->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51814->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51815->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51817->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51818->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51819->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51820->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51821->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51822->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51824->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51826->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51829->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51830->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51852->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51857->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51860->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51862->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51867->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51869->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51882->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51884->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51885->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51888->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51891->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51892->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51921->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51929->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51936->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51937->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51940->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51943->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51946->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51947->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51948->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51949->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51951->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51952->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51953->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51954->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51955->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51956->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51957->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51958->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51959->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51960->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51963->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:51964->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52013->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52015->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52019->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52020->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52021->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52022->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52024->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52029->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52031->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52033->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52038->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52040->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52041->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52044->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52045->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52046->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52087->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52091->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52118->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52120->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52123->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52126->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52134->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52136->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52137->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52139->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52140->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52141->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52142->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52143->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52144->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52146->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52147->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52148->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52149->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52150->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52151->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52153->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52154->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52156->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52158->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52159->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52342->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52449->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52456->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52457->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52460->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52461->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52462->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52463->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52465->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52468->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52470->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52600->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52666->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:52795->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:53136->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:53262->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:53315->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:53466->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:53502->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:53551->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:53698->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:53985->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:54058->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:54164->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:54169->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:54172->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:54274->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:54275->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:54278->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": read tcp 127.0.0.1:54285->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health": write tcp 127.0.0.1:51961->127.0.0.1:8000: write: broken pipe
  [1]	Get "http://localhost:8000/health": write tcp 127.0.0.1:52796->127.0.0.1:8000: write: broken pipe
  [1]	Get "http://localhost:8000/health": write tcp 127.0.0.1:54042->127.0.0.1:8000: write: broken pipe
  [27]	Get "http://localhost:8000/health/": dial tcp [::1]:8000: connect: connection refused
  [1]	Get "http://localhost:8000/health/": read tcp 127.0.0.1:52160->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health/": read tcp 127.0.0.1:52289->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health/": read tcp 127.0.0.1:52331->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health/": read tcp 127.0.0.1:52535->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health/": read tcp 127.0.0.1:52601->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health/": read tcp 127.0.0.1:52670->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health/": read tcp 127.0.0.1:53286->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health/": read tcp 127.0.0.1:53290->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health/": read tcp 127.0.0.1:53318->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health/": read tcp 127.0.0.1:53326->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health/": read tcp 127.0.0.1:53636->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health/": read tcp 127.0.0.1:53653->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health/": read tcp 127.0.0.1:53687->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health/": read tcp 127.0.0.1:53688->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health/": read tcp 127.0.0.1:53693->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health/": read tcp 127.0.0.1:53696->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health/": read tcp 127.0.0.1:53699->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health/": read tcp 127.0.0.1:54163->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health/": read tcp 127.0.0.1:54166->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health/": read tcp 127.0.0.1:54167->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health/": read tcp 127.0.0.1:54168->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://localhost:8000/health/": read tcp 127.0.0.1:54273->127.0.0.1:8000: read: connection reset by peer